let handler = m => m
handler.all = async function (m) {
  global.menumain = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
│╰┄┄────────╼⋫
│
│╭⊣「 *MAIN MENU* 」⊢▤
││${pref} *ᴀғᴋ <ᴀʟᴀsᴀɴ>*
││${pref} *ᴀɪᴍᴇɴᴜ*
││${pref} *ᴀʟʟᴍᴇɴᴜ*
││${pref} *ᴀɴɪᴍᴇ*
││${pref} *ʙᴜʏᴘʀᴇᴍ*
││${pref} *ᴄᴇᴋsɴ* Ⓛ
││${pref} *ᴄᴏɴғᴇss (ʀᴏᴏᴍ)* Ⓛ
││${pref} *ᴅᴀғᴛᴀʀ <ɴᴀᴍᴀ>.<ᴜᴍᴜʀ>*
││${pref} *ᴅᴀғᴛᴀʀ2*
││${pref} *ᴅᴏɴᴀsɪ*
││${pref} *ᴅᴏɴᴀsɪ2* Ⓛ
││${pref} *ɢᴄʙᴏᴛ*
││${pref} *ʟᴇғᴛ (ᴄᴏɴғᴇss)*
││${pref} *ʟᴏᴀᴅɪɴɢ*
││${pref} *ʟᴏᴄᴀᴛɪᴏɴ*
││${pref} *ʟᴏᴄᴀᴛɪᴏɴ2* Ⓖ
││${pref} *ᴍᴀɪɴᴍᴇɴᴜ*
││${pref} *ᴍᴇɴғᴇss*
││${pref} *ᴍᴇɴᴜᴄᴜsᴛᴏᴍᴛᴇxᴛ*
││${pref} *ᴍᴇɴᴜᴅᴏᴡɴʟᴏᴀᴅᴇʀ*
││${pref} *ᴍᴇɴᴜɢᴀᴍᴇ*
││${pref} ᴍᴇɴᴜʀᴘɢ
││${pref} *ᴍᴇɴᴜsᴛɪᴄᴋᴇʀ*
││${pref} *ᴍᴏᴅᴇ*
││${pref} *ᴏs*
││${pref} *ᴘʀᴇᴍɪᴜᴍ*
││${pref} *ʀᴇғᴇʀᴀʟ*
││${pref} *ʀᴇɢᴍᴀɪʟ* Ⓛ
││${pref} ʀᴇɢɴᴏᴍ Ⓖ
││${pref} *ʀᴜʟᴇs*
││${pref} *sᴄ*
││${pref} *sᴄʀɪᴘᴛ*
││${pref} *sᴇᴛᴘʀᴏғɪʟᴇ*
││${pref} *sᴇᴡᴀ*
││${pref} *sᴘᴀᴄᴇ*
││${pref} *sᴜʙᴍᴇɴᴜ*
││${pref} *ᴜɴʀᴇɢ <sᴇʀɪᴀʟ ɴᴜᴍʙᴇʀ>*
││${pref} *ᴠᴇʀᴄᴏᴅᴇ* Ⓛ
││${pref} *ᴠᴇʀᴏᴛᴘ*   Ⓖ
│╰──────────────╼㋛
╰⊣ ${sk}

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menuai = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
│╰┄┄────────╼⋫
│
│╭⊣「 *AI MENU* 」⊢▤
││${pref} *ᴀɪᴅʀᴀᴡ* Ⓛ
││${pref} *ᴀɪᴛᴜʀʙᴏ* Ⓟ
││${pref} *ʙʟᴀᴄᴋʙᴏx* Ⓛ
││${pref} *ᴅɪꜰꜰᴜꜱɪᴏɴ* Ⓟ
││${pref} *ᴅɪꜰꜰᴜꜱɪᴏɴ2* Ⓛ
││${pref} *ɢʙᴀʀᴅ* Ⓛ
││${pref} *ɴᴜʟɪꜱ* Ⓛ
││${pref} *ᴏᴘᴇɴᴀɪ* Ⓛ
││${pref} *ᴛᴜʀɴᴍᴇ* Ⓛ
││${pref} *ᴛxᴛ2ɪᴍɢ* Ⓟ
│╰──────────────╼㋛
╰⊣ ${sk}

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menuanime = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
│╰┄┄────────╼⋫
│
│╭⊣「 *ANIME MENU* 」⊢▤
││${pref} *ᴀʜᴇɢᴀᴏ* Ⓛ
││${pref} *ᴀᴋɪʀᴀ* Ⓛ
││${pref} *ᴀᴋɪʏᴀᴍᴀ* Ⓛ
││${pref} *ᴀᴍᴠ* Ⓛ
││${pref} *ᴀɴᴀ* Ⓛ
││${pref} *ᴀɴɪᴍᴇsᴇᴀʀᴄʜ* Ⓛ
││${pref} *ᴀɴɪᴍᴇsᴛɪᴄᴋ*  Ⓟ
││${pref} *ᴀsᴜɴᴀ* Ⓛ
││${pref} *ᴀʏᴜᴢᴀᴡᴀ* Ⓛ
││${pref} *ʙᴏʀᴜᴛᴏ* Ⓛ
││${pref} *ᴄʜᴀʀᴀᴄᴛᴇʀ <ᴛᴇᴋs>*
││${pref} *ᴄʜɪʜᴏ* Ⓛ
││${pref} *ᴄʜɪᴛᴏɢᴇ* Ⓛ
││${pref} *ᴄᴏsᴘʟᴀʏ* Ⓛ
││${pref} *ᴄᴏsᴘʟᴀʏʟᴏʟɪ* Ⓛ
││${pref} *ᴄᴏsᴘʟᴀʏsᴀɢɪʀɪ* Ⓛ
││${pref} *ᴅᴏʀᴀᴇᴍᴏɴ* Ⓛ
││${pref} *ᴇʙᴀ* Ⓛ
││${pref} *ᴇʟᴀɪɴᴀ* Ⓛ
││${pref} *ᴇᴍɪʟɪᴀ* Ⓛ
││${pref} *ᴇʀᴏ* Ⓛ
││${pref} *ᴇʀᴢᴀ* Ⓛ
││${pref} *ғᴀɴᴀʀᴛ*  Ⓟ
││${pref} *ɢᴀɴɢʙᴀɴɢ*  Ⓟ
││${pref} *ɢᴇɴsʜɪɴ*
││${pref} *ɢɪɴᴀᴍᴇᴄᴀʀᴅ* Ⓛ
││${pref} *ɢɪᴏᴜᴛғɪᴛ* Ⓛ
││${pref} *ɢᴏᴊᴏ*
││${pref} *ɢʀᴇᴍᴏʀʏ* Ⓛ
││${pref} *ʜᴇsᴛɪᴀ* Ⓛ
││${pref} *ʜɪɴᴀᴛᴀ* Ⓛ
││${pref} *ʜᴜsʙᴜ* Ⓛ
││${pref} *ɪɴғᴏᴀɴɪᴍᴇ* Ⓛ
││${pref} *ɪɴᴏʀɪ* Ⓛ
││${pref} *ɪsᴜᴢᴜ* Ⓛ
││${pref} *ɪᴛᴀᴄʜɪ* Ⓛ
││${pref} *ɪᴛᴏʀɪ* Ⓛ
││${pref} *ᴊᴜsᴛɪɴᴀ* Ⓛ
││${pref} *ᴋᴀɢᴀ* Ⓛ
││${pref} *ᴋᴀɢᴜʀᴀ* Ⓛ
││${pref} *ᴋᴀᴋᴀsʜɪ* Ⓛ
││${pref} *ᴋᴀɴᴇᴋɪ* Ⓛ
││${pref} *ᴋᴀᴏʀɪ* Ⓛ
││${pref} *ᴋᴏᴍɪᴋᴜ* Ⓛ
││${pref} *ᴋᴏᴛᴏʀɪ* Ⓛ
││${pref} *ᴋᴜʀᴜᴍɪ* Ⓛ
││${pref} *ᴋᴜsᴏɴɪᴍᴇ* Ⓛ
││${pref} *ʟᴏʟɪ* Ⓛ
││${pref} *ᴍᴀᴅᴀʀᴀ* Ⓛ
││${pref} *ᴍᴇɢᴜᴍɪɴ* Ⓛ
││${pref} *ᴍɪᴋᴀsᴀ* Ⓛ
││${pref} *ᴍɪᴋᴇʏ* Ⓛ
││${pref} *ᴍɪᴋᴜ* Ⓛ
││${pref} *ᴍɪɴᴀᴛᴏ* Ⓛ
││${pref} *ɴᴀʀᴜᴛᴏ* Ⓛ
││${pref} *ɴᴇᴋᴏ* Ⓛ
││${pref} *ɴᴇᴋᴏɴɪᴍᴇ* Ⓛ
││${pref} *ɴᴇᴢᴜᴋᴏ* Ⓛ
││${pref} *ᴏɴᴇᴘɪᴇᴄᴇ* Ⓛ
││${pref} *ᴏɴɢᴏɪɴɢ*
││${pref} *ᴘᴏᴋᴇᴍᴏɴ* Ⓛ
││${pref} *ǫᴜᴏᴛᴇsᴀɴɪᴍᴇ*
││${pref} *ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ* Ⓛ
││${pref} *sᴀɢɪʀɪ* Ⓛ
││${pref} *sᴀᴋᴜʀᴀ* Ⓛ
││${pref} *sᴀsᴜᴋᴇ* Ⓛ
││${pref} *sʜɪɴᴀ* Ⓛ
││${pref} *sʜɪɴᴋᴀ* Ⓛ
││${pref} *sʜɪɴᴏᴍɪʏᴀ* Ⓛ
││${pref} *sʜɪᴢᴜᴋᴀ* Ⓛ
││${pref} *sʜᴏᴛᴀ* Ⓛ
││${pref} *sᴛɪᴄᴋᴇʀʜᴜɢ* Ⓛ
││${pref} *ᴛᴇᴊɪɴᴀ* Ⓛ
││${pref} *ᴛɪᴇʀɪɴɢ*
││${pref} *ᴛᴏᴜᴋᴀᴄʜᴀɴ* Ⓛ
││${pref} *ᴛsᴜɴᴀᴅᴇ* Ⓛ
││${pref} *ᴜᴘᴅᴀᴛᴇᴀɴɪᴍᴇ* Ⓛ
││${pref} *ᴡᴀɪғᴜ* Ⓛ
││${pref} *ᴡᴀɪғᴜ2* Ⓛ
││${pref} *ᴡʜᴀᴛᴀɴɪᴍᴇ* Ⓛ
││${pref} *ʏᴏᴛsᴜʙᴀ* Ⓛ
││${pref} *ʏᴜᴋɪ* Ⓛ
││${pref} *ʏᴜᴍᴇᴋᴏ* Ⓛ
│╰──────────────╼㋛
╰⊣ ${sk}

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menucustomtext = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
│╰┄┄────────╼⋫
│
│╭⊣「 *CUSTOM TEXT MENU* 」⊢▤
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ (random)* Ⓛ
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ 1* Ⓛ
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ 2* Ⓛ
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ 3* Ⓛ
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ 4* Ⓛ
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ 5* Ⓛ
││${pref} *ғʟᴀᴍɪɴɢᴛᴇxᴛ 6* Ⓛ
│╰──────────────╼㋛
╰⊣ ${sk}

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menurpg = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
││Ⓖ : *Group*
│╰┄┄────────╼⋫
│
│╭⊣「 *RPG ABSEN* 」⊢▤
││${pref} *ᴄᴏᴅᴇsʜᴏʀᴛʟɪɴᴋ* Ⓛ
││${pref} *ᴅᴀɪʟʏ* Ⓛ
││${pref} *ɢᴇᴛᴘʀɪᴢᴇ*
││${pref} *ʜᴏᴜʀʟʏ* Ⓛ
││${pref} *ᴍᴏɴᴛʜʟʏ* Ⓛ
││${pref} *ɢᴀᴊɪᴀɴ* Ⓛ
││${pref} *ɢᴇᴛʜᴀᴅɪᴀʜ*
││${pref} *ᴡᴇᴇᴋʟʏ* Ⓛ
││${pref} *ʏᴇᴀʀʟʏ* Ⓛ
│╰──────────────╼㋛
│
│╭⊣「 *RPG MENU* 」⊢▤
││${pref} *ᴀᴅᴠᴇɴᴛᴜʀᴇ* Ⓛ Ⓖ
││${pref} *ᴀᴛᴍ <ᴊᴜᴍʟᴀʜ>* Ⓛ
││${pref} *ᴀᴛᴍᴀʟʟ* Ⓛ
││${pref} *ʙᴀɴᴋ*
││${pref} *ʙᴀɴsᴏs* Ⓛ
││${pref} *ʙᴇʀʙɪsɴɪs* Ⓛ Ⓖ
││${pref} *ʙᴇʀʙᴜʀᴜ*
││${pref} *ʙᴇʀᴅᴀɢᴀɴɢ <@ᴛᴀɢ>* Ⓛ Ⓖ
││${pref} *ʙᴇʀᴋᴇʙᴏɴ* Ⓛ Ⓖ
││${pref} *ʙʟᴀᴄᴋᴊᴀᴄᴋ*
││${pref} *ʙᴜᴀʜ*
││${pref} *ʙᴜɪʟᴅ <ʙᴀɴɢᴜɴᴀɴ>*
││${pref} *ᴄᴏᴏᴋ <ᴍᴀsᴀᴋᴀɴ> <ᴀʀɢs>*
││${pref} *ᴅᴜɴɢᴇᴏɴ [ɴᴀᴍᴀ ʀᴏᴏᴍ]*
││${pref} *ᴇᴀᴛ <ᴛʏᴘᴇ>*
││${pref} *ᴇɴᴄʜᴀɴᴛ <ᴛᴏᴏʟs>* Ⓛ
││${pref} *ғᴇᴇᴅ* Ⓛ
││${pref} *ғɪɢʜᴛᴄᴇɴᴛᴀᴜʀ* Ⓛ Ⓖ
││${pref} *ғɪɢʜᴛɢʀɪғғɪɴ* Ⓛ Ⓖ
││${pref} *ғɪɢʜᴛɪɴɢ* Ⓛ Ⓖ
││${pref} *ғɪɢʜᴛᴋᴜᴄɪɴɢ* Ⓛ Ⓖ
││${pref} *ғɪɢʜᴛᴋʏᴜʙɪ* Ⓛ Ⓖ
││${pref} *ғɪɢʜᴛɴᴀɢᴀ* Ⓛ Ⓖ
││${pref} *ғɪɢʜᴛᴘʜᴏɴɪx* Ⓛ Ⓖ
││${pref} *ʜᴇᴀʟ* Ⓛ
││${pref} *ʜᴜɴᴛᴇʀ* Ⓛ Ⓖ
││${pref} *ɪɴᴠ* Ⓛ
││${pref} *ᴋᴀɴᴅᴀɴɢ*
││${pref} *ᴋᴇʀᴊᴀ*
││${pref} *ᴋɪʟʟ*
││${pref} *ᴋᴏʙᴏʏ*
││${pref} *ᴋᴏʟᴀᴍ* Ⓛ Ⓖ
││${pref} *ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ* Ⓟ Ⓖ
││${pref} *ʟᴇᴠᴇʟᴜᴘ*
││${pref} *ᴍᴀʟɪɴɢ*
││${pref} *ᴍᴀsᴀᴋ <ᴍᴀsᴀᴋᴀɴ> <ᴀʀɢs>*
││${pref} *ᴍᴇᴍʙᴜɴᴜʜ <@ᴛᴀɢ>* Ⓛ Ⓖ
││${pref} *ᴍᴇʀᴀᴄɪᴋ <ᴛʏᴘᴇ>* Ⓛ Ⓖ
││${pref} *ᴍᴇʀᴀᴍᴘᴏᴋ <@ᴛᴀɢ>* Ⓛ Ⓖ
││${pref} *ᴍɪssɪᴏɴ*
││${pref} *ᴍᴜʟᴜɴɢ* Ⓛ Ⓖ
││${pref} *ɴᴀᴍʙᴀɴɢ* Ⓛ Ⓖ
││${pref} *ɴᴇʙᴀɴɢ* Ⓛ Ⓖ
││${pref} *ɴɢᴇᴡᴇ* Ⓖ
││${pref} *ᴏᴊᴇᴋ*
││${pref} *ᴏᴘᴇɴ <ᴄʀᴀᴛᴇ>* Ⓛ Ⓖ
││${pref} *ᴘᴀɴᴄɪɴɢ <ᴛʏᴘᴇ>* Ⓛ
││${pref} *ᴘᴀsᴀʀ <ᴊᴜᴀʟ> <ᴀʀɢs>*
││${pref} *ᴘᴇʀsᴇᴅɪᴀᴀɴ*
││${pref} *ᴘᴇᴛ*
││${pref} *ᴘᴇᴛsʜᴏᴘ*
││${pref} *ᴘᴏʟɪsɪ*
││${pref} *ᴘᴜʟʟ <ᴊᴜᴍʟᴀʜ>*
││${pref} *ᴘᴜʟʟᴀʟʟ*
││${pref} *ʀᴀᴍᴜᴀɴ* Ⓛ Ⓖ
││${pref} *ʀᴇᴘᴀɪʀ*
││${pref} *ʀᴏᴋᴇᴛ* Ⓖ
││${pref} *sᴇʟᴇᴄᴛᴊᴏʙ* Ⓛ
││${pref} *sᴇʟᴇᴄᴛsᴋɪʟʟ*
││${pref} *sʜᴏᴘ <sᴇʟʟ|ʙᴜʏ> <ᴀʀɢs>*
││${pref} *ᴛᴀxʏ*
││${pref} *ᴛᴏᴏʟs* Ⓛ
││${pref} *ᴛʀᴀɴsғᴇʀ* Ⓛ Ⓖ
││${pref} *ᴜᴘɢʀᴀᴅᴇ <ʙᴀɴɢᴜɴᴀɴ>*
││${pref} *ᴡᴏʀᴋ*
│╰──────────────╼㋛
╰⊣ ⌕ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ ⌕

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menusticker = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
││Ⓖ : *Group*
│╰┄┄────────╼⋫
│
│╭⊣「 *STICKER MENU* 」⊢▤
││${pref} *ᴀɴɪᴍᴇsᴛɪᴄᴋ* Ⓟ
││${pref} *ᴀᴛᴛᴘ <ᴛᴇᴋs>* Ⓛ
││${pref} *ᴅᴀᴅᴜ*
││${pref} *ᴇᴍᴏᴊɪᴍɪx* Ⓛ
││${pref} *ɢᴏᴊᴏ*
││${pref} *ǫᴄ*
││${pref} *sᴇᴍᴏᴊɪ* Ⓛ
││${pref} *sᴍᴇᴍᴇ*
││${pref} *sᴛɪᴄᴋᴇʀ <ᴄᴀᴘᴛɪᴏɴ/ʀᴇᴘʟʏ>*
││${pref} *sᴛɪᴄᴋᴇʀʜᴜɢ* Ⓛ
││${pref} *sᴛɪᴄᴋᴍᴀᴋᴇʀ <ᴄᴀᴘᴛɪᴏɴ|ʀᴇᴘʟʏ>*
││${pref} *sᴛɪᴋᴇʀᴛᴇʟᴇɢʀᴀᴍ <ᴜʀʟ>* Ⓛ Ⓟ
││${pref} *ᴛᴏɢɪғ*
││${pref} *ᴛᴏᴠɪᴅᴇᴏ*
││${pref} *ᴛʀɪɢɢᴇʀᴇᴅ* Ⓛ
││${pref} *ᴛᴛᴘ*
││${pref} *ᴡᴍ <ᴘᴀᴄᴋɴᴀᴍᴇ>|<ᴀᴜᴛʜᴏʀ>* Ⓛ
│╰──────────────╼㋛
╰⊣ ⌕ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ ⌕

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menugame = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
││Ⓖ : *Group*
│╰┄┄────────╼⋫
│
│╭⊣「 *GAME MENU* 」⊢▤
││${pref} *ᴀsᴀʜᴏᴛᴀᴋ* Ⓛ Ⓖ
││${pref} *ᴀᴛᴋ* Ⓖ
││${pref} *ᴀᴛᴛᴀᴄᴋ* Ⓖ
││${pref} *ᴄᴀsɪɴᴏ <ᴊᴜᴍʟᴀʜ>* Ⓛ
││${pref} *ᴄᴇᴋᴘᴏɪɴ* Ⓛ
││${pref} *ᴄʟᴀɴᴡᴀʀ* Ⓛ Ⓖ
││${pref} *ᴅᴀᴅᴜ*
││${pref} *ᴅᴇʟᴛᴛᴛ* Ⓛ
││${pref} *ғᴀᴍɪʟʏ100* Ⓖ
││${pref} *ᴊᴀᴄᴋᴘᴏᴛ* Ⓖ
││${pref} *ᴊᴜᴅɪ <ᴊᴜᴍʟᴀʜ>* Ⓛ Ⓖ
││${pref} *ʟᴇɴɢᴋᴀᴘɪᴋᴀʟɪᴍᴀᴛ* Ⓖ
││${pref} *ᴍᴀᴛʜ <ᴍᴏᴅᴇ>* Ⓛ Ⓖ
││${pref} *ᴍᴏɴᴇʏᴛᴏᴘᴏɪɴ <ᴊᴜᴍʟᴀʜ ᴜᴀɴɢ>* Ⓛ
││${pref} *ᴘᴀɴᴄɪɴɢ <ᴛʏᴘᴇ>* Ⓛ
││${pref} *ᴘᴏɪɴᴛᴏᴍᴏɴᴇʏ <ᴊᴜᴍʟᴀʜ ᴘᴏɪɴ>* Ⓛ
││${pref} *sɪᴀᴘᴀᴋᴀʜᴀᴋᴜ* Ⓛ Ⓖ
││${pref} *sᴘɪɴ <ᴛᴏᴛᴀʟ ᴘᴏɪɴ>* Ⓛ
││${pref} *sᴜɪᴛ* Ⓛ Ⓖ
││${pref} *sᴜɪᴛᴘᴠᴘ @ᴛᴀɢ* Ⓛ Ⓖ
││${pref} *sᴜsᴜɴᴋᴀᴛᴀ* Ⓛ Ⓖ
││${pref} *ᴛᴇʙᴀᴋᴀɴɪᴍᴇ* Ⓛ
││${pref} *ᴛᴇʙᴀᴋʙᴇɴᴅᴇʀᴀ* Ⓛ Ⓖ
││${pref} *ᴛᴇʙᴀᴋʙᴏᴍ*
││${pref} *ᴛᴇʙᴀᴋᴄʜᴀʀᴀ*
││${pref} *ᴛᴇʙᴀᴋɢᴀᴍʙᴀʀ*
││${pref} *ᴛᴇʙᴀᴋɢᴀᴍᴇ* Ⓛ
││${pref} *ᴛᴇʙᴀᴋᴋᴀᴛᴀ* Ⓖ
││${pref} *ᴛᴇʙᴀᴋᴋɪᴍɪᴀ* Ⓛ Ⓖ
││${pref} *ᴛᴇʙᴀᴋʟᴀɢᴜ* Ⓛ Ⓖ
││${pref} *ᴛᴇʙᴀᴋʟɪʀɪᴋ* Ⓛ
││${pref} *ᴛᴇʙᴀᴋʟᴏɢᴏ*
││${pref} *ᴛᴇʙᴀᴋsᴜʀᴀʜ*
││${pref} *ᴛᴇʙᴀᴋᴜᴍᴜʀ* Ⓛ
││${pref} *ᴛᴇᴋᴀᴛᴇᴋɪ* Ⓛ Ⓖ
││${pref} *ᴛɪᴄᴛᴀᴄᴛᴏᴇ <ᴄᴜsᴛᴏᴍ ʀᴏᴏᴍ>* Ⓖ
││${pref} *ᴛᴛᴛ <ᴄᴜsᴛᴏᴍ ʀᴏᴏᴍ>* Ⓖ
││${pref} *ᴡᴀʀ* Ⓖ
││${pref} *ᴡᴇʀᴇᴡᴏʟғ* Ⓖ
││${pref} *ᴡɪʙᴜᴄᴇᴋ* Ⓛ
│╰──────────────╼㋛
╰⊣ ⌕ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ ⌕

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.menudl = (pref) => {
    return `
╭╌─┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄╼⊚
│╭⊣「 *INFO CMD* 」
││Ⓛ : *Free User*
││Ⓟ : *Premium User*
││Ⓖ : *Group*
│╰┄┄────────╼⋫
│
│╭⊣「 *DOWNLOADER MENU* 」⊢▤
││${pref} *ᴀɪᴏᴠɪᴅᴇᴏ <ᴜʀʟ>*
││${pref} *ᴄᴀᴘᴄᴜᴛ <ᴜʀʟ>* Ⓛ
││${pref} *ᴄᴀᴘᴄᴜᴛᴍᴘ3 <ᴜʀʟ>* Ⓛ
││${pref} *ᴄᴏᴄᴏғᴜɴ <ᴜʀʟ>*
││${pref} *ғᴀᴄᴇʙᴏᴏᴋ <ᴜʀʟ>* Ⓛ
││${pref} *ғᴀᴄᴇʙᴏᴏᴋ* Ⓛ
││${pref} *ғᴀᴄᴇʙᴏᴏᴋ2 <ᴜʀʟ>*
││${pref} *ғʙʀᴇᴇʟ* Ⓛ
││${pref} *ɢᴅʀɪᴠᴇ* Ⓛ
││${pref} *ɢɪᴛᴄʟᴏɴᴇ <ᴜʀʟ>* Ⓛ
││${pref} *ʜᴀᴘᴘʏᴍᴏᴅ <ǫᴜᴇʀʏ>*
││${pref} *ʜᴀᴘᴘʏᴍᴏᴅᴅʟ <ᴜʀʟ>*
││${pref} *ɪɢ3*
││${pref} *ɪɢsᴛᴏʀʏ*
││${pref} *ɪɴsᴛᴀɢʀᴀᴍ* Ⓛ
││${pref} *ɪɴsᴛᴀɢʀᴀᴍ2* Ⓛ
││${pref} *ᴊᴏᴏx <ᴊᴜᴅᴜʟ>* Ⓛ
││${pref} *ᴋʀᴀᴋᴇɴ* Ⓛ
││${pref} *ʟɪʀᴘʟᴀʏ* Ⓛ Ⓖ
││${pref} *ʟɪʀᴘʟᴀʏ2* Ⓛ Ⓖ
││${pref} *ᴍᴇᴅɪᴀғɪʀᴇ <ᴜʀʟ>*
││${pref} *ɴᴇᴋᴏᴅᴏᴡɴʟᴏᴀᴅ* Ⓟ
││${pref} *ɴʜᴇɴᴛᴀɪ* Ⓟ
││${pref} *ᴘɪɴᴅʟ* Ⓛ
││${pref} *ᴘɪxɪᴠᴅʟ*
││${pref} *ᴘʟᴀʏ*
││${pref} *sғɪʟᴇ* Ⓛ Ⓖ
││${pref} *sɴᴀᴄᴋ <ᴜʀʟ>*
││${pref} *sᴘᴏᴛɪғʏ* Ⓛ
││${pref} *ᴛɪᴋᴛᴏᴋ*
││${pref} *ᴛɪᴋᴛᴏᴋ2*
││${pref} *ᴛɪᴋᴛᴏᴋᴍᴘ3 <ᴜʀʟ>*
││${pref} *ᴛɪᴋᴛᴏᴋɴᴏᴡᴍ <ᴜʀʟ>*
││${pref} *ᴛɪᴋᴛᴏᴋᴘʜᴏᴛᴏ*
││${pref} *ᴛɪᴋᴛᴏᴋsᴛᴏʀʏ* Ⓛ
││${pref} *ᴛᴡɪᴛᴛᴇʀ <ᴜʀʟ>* Ⓛ Ⓖ
││${pref} *xɴxxᴅʟ <ᴜʀʟ>* Ⓟ
││${pref} *ʏᴛᴀ*
││${pref} *ʏᴛᴍᴘ3*
││${pref} *ʏᴛᴍᴘ4*
││${pref} *ᴢɪᴘᴘʏsʜᴀʀᴇ <ᴜʀʟ>* Ⓛ Ⓟ
│╰──────────────╼㋛
╰⊣ ⌕ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ ⌕

Jɪᴋᴀ ᴀᴅᴀ ғɪᴛᴜʀ ʏᴀɴɢ ᴇʀʀᴏʀ, sɪʟᴀʜᴋᴀɴ ᴋᴇᴛɪᴋ *#ʀᴇᴘᴏʀᴛ*

 ${wm}
`.trim()
  }
  
  global.editMsg = (key, text) => {
    return this.relayMessage(m.chat, {
      protocolMessage: {
        type: 14,
        key: key,
        editedMessage: {
          conversation: text
        }
      }
    }, {})
  }
}

module.exports = handler